## 🚀 Terraform Apply Result

| Path | Outcome | Changes |
| :--- | :---: | :--- |
| `environments/test2` | ✅ | +2 |

<details><summary><strong>Show Output Details</strong></summary>

### 📂 `environments/test2`

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.main will be created
  + resource "random_id" "main" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.main.null_resource.default will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = (known after apply)
          + "name" = "test2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + result = {}
random_id.main: Creating...
random_id.main: Creation complete after 0s [id=HK1wQnM6Iuk]
module.main.null_resource.default: Creating...
module.main.null_resource.default: Creation complete after 0s [id=3023657532732404039]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

result = {}

```

</details>